import React from 'react'
import styled from 'styled-components';
import { useNavigate } from 'react-router-dom';

import {
    PostHeaderWrap,
    ChattingBackKey,
    PageTitle,
    HeadrIconsWrap,
    IconNotification,
    IconSetting
  } from "../styles/StyledHeader.js";

import IconBackKey from "../assets/icon-left-arrow.svg";

function TermsConditions() {
    const navigate = useNavigate();
  return (
      <TermsConditionsWrap>
        <PostHeaderWrap>
          <ChattingBackKey
            src={IconBackKey}
            onClick={() => {
              navigate("/main");
            }}
          />
          <PageTitle>이용약관</PageTitle>
          <HeadrIconsWrap>
            <IconNotification style={{ display:"none"}} />
            <IconSetting style={{ visibility:"hidden"}} />
          </HeadrIconsWrap>
        </PostHeaderWrap>
        <div style={{ display:"flex", width:"100%", flexDirection:"column", marginRight:"auto" }}>
          <h3 style={{marginBottom:"-10px"}}>제 1 장 총칙</h3>
          <div style={{marginLeft:"10px"}}>
            <h4>제 1 조 (목적)</h4>
            <div style={{ lineHeight:"200%", fontSize:"13px" }}>
            이 약관은 Bungle(이하 ‘회사’라 합니다.)가 제공하는 Bungle서비스 및 Bungle 관련 제반 서비스(이하 ‘서비스'라고 하며, 접속 가능한 유∙무선 단말기의 종류와는 상관없이 이용 가능한 ‘회사'가 제공하는 모든 ‘서비스'를 의미합니다. 이하 같습니다)를 이용자(이하 ‘회원’)가 이용함에 있어 회사와 회원 간의 권리와 의무, 책임사항 및 회사의 서비스 이용절차에 관한 필요사항을 규정함을 목적으로 합니다.
            </div>
            <h4>제 2 조 (용어의 정의)</h4>
            <div style={{ lineHeight:"200%", fontSize:"13px"}}>
            1. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br/>
            <div style={{marginLeft:"7px"}}>
            1) Bungle(이하 "서비스")란 이용자들이 PC와 모바일에서 일상 생활에서의 모임 활동과 관련된 콘텐츠를 게시하고, 그 외 이용자가 콘텐츠를 소비하면서 채팅창 대화나 영상통화 등을 통해 소통할 수 있는 모임 활동 연계 플랫폼 서비스입니다.<br/>
            2) “회원“이란 본 약관에 동의하고 회사가 제공하는 서비스 이용 자격을 부여받은 자를 의미합니다.<br/>
            3) “회원 탈퇴”란 이용자가 서비스 이용 계약을 종료시키는 의사표시를 말합니다.<br/>
            </div>
            2. 이 약관에서 사용하는 용어의 정의는 제1항에서 정하는 것을 제외하고는 관계 법령에서 정하는 바를 따릅니다.
            </div>
            <h4>제 3 조 (약관의 명시, 효력 및 변경)</h4>
            <div style={{ lineHeight:"200%", fontSize:"13px"}}>
            1. 회사는 서비스의 설정페이지에 이 약관을 명시합니다.<br/>
            2. 이 약관은 이용자가 서비스를 이용함과 동시에 효력이 발생하며, 이 약관에 동의하지 않을 경우 이용자는 서비스 이용계약을 철회할 수 있습니다.<br/>
            3. 회사는 이 약관을 관련 법령에 위배되지 않는 범위에서 변경할 수 있습니다.<br/>
            4. 회사가 본 약관을 개정할 경우에는 개정된 내용, 개정약관의 적용일자 및 개정사유를 명시하여 개정 약관의 적용일자 7일 전부터 적용일 전일까지 서비스 화면에 공지하고, 개정 내용이 이용자에게 불리할 경우에는 개정약관 적용일자 30일 전부터 서비스 화면에 공지합니다.<br/>
            5. 이용자는 변경된 약관에 동의하지 않을 권리가 있으며, 변경된 약관에 동의하지 않을 경우에는 서비스 이용을 중단하고 탈퇴할 수 있습니다.<br/>
            6. 변경된 약관 공지 시 이용자가 회사에 명시적으로 "거부"의 의사표시를 하지 않거나 또는 이용자가 변경된 이용약관의 적용일 이후에도 서비스를 계속 사용하는 경우에는 변경된 약관에 동의한 것으로 간주합니다.<br/>
            </div>
          </div>
          <h3 style={{marginBottom:"-10px"}}>제 2 장 이 용</h3>
          <div style={{marginLeft:"10px"}}>
            <h4>제 4조 (서비스 가입 및 계정)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 이용자는 회사가 제공하는 방식을 통해 서비스에 가입할 수 있습니다.<br/>
              2. 회사는 서비스에 가입한 이용자에게 닉네임이 포함된 계정을 제공합니다.<br/>
              3. 이용자는 자신의 계정을 성실히 관리하여야 합니다. 이용자가 본인의 계정을 소홀히 관리하거나 제3자에게 이용을 승낙함으로써 발생하는 손해에 대하여는 이용자에게 책임이 있습니다.<br/>
              </div>
            <h4>제 5조 (개인정보의 보호 및 관리)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 이용자가 이 약관에 따라 회사에 정보를 제공할 경우에는 진실된 정보를 제공하여야 하며, 이용자는 허위정보 제공으로 인해 발생한 불이익에 대해서는 보호받지 못합니다.<br/>
              2. 회사는 관계 법령이 정하는 바에 따라 이용자의 개인정보를 보호하기 위해 노력합니다.<br/>
              3. 이용자 개인정보의 보호 및 사용에 대해서는 관계 법령 및 회사가 별도로 고지하는 개인정보취급방침에 따릅니다.<br/>
              </div>
            <h4>제 6조 (회사의 의무)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 관계 법령을 준수하고, 이 약관에서 정하는 권리의 행사와 의무의 이행을 신의에 따라 성실하게 수행합니다.<br/>
              2. 회사는 계속적이고 안정적인 서비스의 제공을 위하여 최선의 노력을 다합니다.<br/>
              3. 회사는 이용자들이 서비스를 편리하게 이용할 수 있도록 최선의 노력을 다합니다.<br/>
              4. 회사는 이용자가 제기한 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는 합리적인 기간 내에 신속하게 처리하기 위해 노력합니다.<br/>
              </div>
            <h4>제 7조 (이용자의 의무)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 이용자는 서비스를 본래의 이용 목적 이외의 용도로 사용하거나 다음 각 호에 해당하는 행위를 해서는 안 되며, 각 호에 해당된다고 의심되는 이용자를 발견할 시 관리자나 bungle.master01@gmail.com을 통해 신고를 접수하여야 합니다.<br/>
              <div style={{marginLeft:"7px"}}>
              1) 다른 이용자의 계정 혹은 회사의 관리자를 사칭하는 행위<br/>
              2) 서비스 이용 중 허위 사실을 기재하여 서비스 운영을 방해하는 행위<br/>
              3) 회사가 제공한 계정을 타인에게 양도하는 행위<br/>
              4) 회사의 서비스를 이용하여 얻은 정보를 회사의 사전 승낙없이 복제, 유통하여 상업적으로 이용하는 행위<br/>
              5) 사기성, 음란성, 사행성, 혐오성 메시지 혹은 음성 등이 담긴 콘텐츠를 방송하거나 게시하는 행위<br/>
              6) 타인의 명예를 훼손하거나 사이버 불링, 폭력적인 행위를 하는 등 이용자의 정상적인 서비스 이용을 방해하는 행위<br/>
              7) 저작권을 포함한 지적재산권, 초상권 등 회사 및 제3자의 기타 권리를 침해하는 행위<br/>
              8) 타인의 개인정보를 동의없이 수집, 저장, 유포, 게시하는 행위<br/>
              9) 일반적이지 않은 방식으로 데이터를 조작하여 회사의 서비스 운영을 방해하는 행위<br/>
              10) 컴퓨터 소프트웨어, 하드웨어, 전기 통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 전송, 게시, 유포, 사용하는 행위<br/>
              11) 서버 해킹, 데이터 유출, 버그 등을 통해 서비스를 변경하거나 회사가 정하지 않은 방식으로 서비스를 이용하는 행위<br/>
              12) 관계 법령, 서비스이용약관, 공지사항, 커뮤니티 가이드라인을 위배하는 행위<br/>
              13) 기타 공공질서 및 미풍양속을 위반하거나 불법적, 부당한 방식의 행동을 하는 행위<br/>
              </div>
              2. 회사는 이용자가 제1항의 각 호에서 정한 사항을 위반하거나 서비스를 본래의 이용 목적 이외의 용도로 사용하여 회사의 서비스에 지장을 초래한 경우, 사전 통보 없이 운영 정책에 따라 한시적 이용정지 또는 영구 이용정지 등의 조치를 할 수 있습니다. 한시적 이용정지 또는 영구 이용정지 등의 조치를 받으면 서비스에 대한 접근이 불가합니다.<br/>
              3. 회사는 이용자의 이용 제한이 정당한 경우 이로 인하여 이용자가 입은 손해에 대해 배상하지 않습니다.<br/>
              </div>
              <h4>제 8조 (게시물에 대한 저작권)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 서비스에 제공한 이용자의 콘텐츠(음원파일, 라이브 영상, 유튜브 클립 영상, 업로드 영상, 방송공지나 피드 등에 게시한 글, 댓글 등 이용자가 서비스에 제공하거나 서비스를 이용하면서 업로드한 자료 일체)와 관련하여 저작권, 인격권 등 제3자와의 분쟁 발생 시 그 법적 대응 및 결과에 대한 책임은 이용자가 지며 회사는 해당 콘텐츠와 관련된 일체의 책임을 지지 않습니다. <br/>
              2. 회사는 서비스를 통한 저작권 침해 행위나 지적재산권 침해를 허용하지 아니하며 이용자의 콘텐츠가 타인의 지적재산권을 침해한다는 사실을 적절하게 고지 받거나 인지하게 되는 경우 저작권법 및 기타 관련 법령에서 정한 절차에 따라 그 콘텐츠 일체의 서비스를 중지하거나 제거할 수 있습니다. 또한 회사는 이용자의 콘텐츠가 서비스 운영상의 문제가 있다고 판단하는 경우 사전통지 없이 삭제하거나 이동 또는 등록을 거부할 수 있는 권리를 보유합니다.<br/>
              3. 회사는 이용자가 게시한 콘텐츠를 국내외에서 제공하는 관련 서비스 목적(홍보 등)으로 사용할 수 있습니다.<br/>
              4. 제4항의 사용범위는 이용자가 서비스 내에 게시한 콘텐츠의 복제, 수정, 전시, 전송, 배포, 출판 및 2차 저작물과 편집 저작물 작성을 포함합니다.<br/>
              5. 이용자가 게시한 콘텐츠를 상업적 혹은 제4항에서 정하지 않은 방식으로 사용할 경우, 회사는 전화, 팩스, 전자 우편 등의 방식으로 이용자에게 동의를 얻을 수 있으며, 별도의 보상을 할 수 있습니다.<br/>
              </div>
              <h4>제 9조 (서비스의 제공 시간 및 중지, 변경)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴 1일 24시간 서비스를 제공합니다.<br/>
              2. 회사는 시스템 정기점검 등 서비스 운영상 필요한 경우, 일정기간 동안 서비스를 일시 중지시킬 수 있으며, 이러한 경우 회사는 그 내용 및 시간을 서비스 내에 공지합니다. 다만, 회사가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.<br/>
              3. 회사는 새로운 서비스, 각종 버그 패치 등 서비스 운영 또는 기술상 필요한 경우에는 제공하고 있는 서비스의 전부 또는 일부를 수정, 추가, 폐지 등 변경할 수 있습니다. 변경될 서비스의 내용 및 일자 등에 대해서는 서비스 내에 공지함으로써 이용자에 대한 통지를 대체합니다.<br/>
              4. 회사는 서비스의 기획이나 운영상 또는 회사의 긴박한 상황 등에 의해 서비스 전부를 중단할 필요가 있는 경우 서비스 내에 이를 공지하고 서비스의 제공을 중단할 수 있습니다. 단, 회사가 통제할 수 없는 사유로 인한 경우 공지없이 서비스가 중단될 수 있습니다.<br/>
              </div>
          </div>
          <h3 style={{marginBottom:"-10px"}}>제 3 장 부가서비스의 이용</h3>
          <div style={{marginLeft:"10px"}}>
            <h4>제 11 조(손해배상)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              이용자가 이 약관에서 정한 사항을 위반함으로써 회사 또는 제3자에게 손해를 입힌 경우 이용자는 회사 또는 제3자에게 그 손해를 배상하여야 합니다.
              </div>
          </div>
          <div style={{marginLeft:"10px"}}>
            <h4>제 12조(책임 제한)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 서비스의 이용장애 혹은 서비스가 변경되거나 중지된 원인이 회사의 고의 또는 중과실로 인한 경우를 제외하고는 서비스의 이용장애, 변경 및 중지로 인하여 이용자에게 발생하는 손해에 대해서는 책임이 면제됩니다.<br/>
              2. 회사는 이용자가 서비스를 이용하여 기대하는 모임 구성원 등을 얻지 못한 것에 대해서는 책임이 면제됩니다.<br/>
              3. 회사는 이용자가 본인의 개인정보 등(계정 포함)을 변경하여 얻는 불이익 및 정보 상실에 대해서는 책임이 면제됩니다.<br/>
              4. 회사는 이용자 상호간 또는 이용자와 제3자 간에 서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다.<br/>
              </div>
            <h4>제 13조 (재판권 및 준거법)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사와 이용자간에 제기된 소송에는 대한민국 법을 적용합니다.<br/>
              2. 서비스 이용과 관련하여 회사와 이용자 간에 발생한 분쟁에 대해서는 민사소송법의 주소지를 관할하는 법원을 합의관할로 합니다.<br/>
              </div>
            <h4>제 14조 (조사권)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              회원이 이용 조건을 위반하여 회사의 명예와 신용에 중대한 손상을 초래할 우려가 있는 경우 회사는 필요한 조사를 실시할 수 있으며, 특별한 사유가 없는 한 회원은 이에 응해야 합니다.<br/>
              </div>
            <h4>제 15조 (약관 외 준칙)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「전자상거래법」, 「약관 규제법」,「정보통신망법」, 「콘텐츠산업진흥법」 등 관계 법령에 따릅니다.<br/>
              2. 회사는 본 약관 외에 운영정책, 개인정보처리방침 등 개별 약관을 둘 수 있습니다.<br/><br/>
              </div>
              <h4>부칙</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 이 약관은 2022 년 7월 29일부터 적용됩니다.<br/>
              </div>
          </div>
          <div style={{ display:"flex", width:"100%", flexDirection:"column", marginRight:"auto", marginLeft:"0px" }}>
            <h2 style={{marginBottom:"0px"}}>위치기반 서비스 이용약관</h2>
            <h3 style={{marginBottom:"-10px"}}>제 1 장 총칙</h3>
            <div style={{marginLeft:"10px"}}>
            <h4>제 1 조 (목적)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              본 약관은 회원(Bungle 서비스 약관에 동의한 자를 말합니다. 이하 "회원"이라고 합니다.)이 Bungle(이하 "회사"라고 합니다.)이 제공하는 위치기반서비스(이하 "서비스"라고 합니다)를 이용함에 있어 회사와 회원의 권리•의무 및 책임사항을 규정함을 목적으로 합니다.
              </div>
              <h4>제 2 조 (이용약관의 효력 및 변경)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 본 약관은 서비스를 신청한 고객 또는 개인위치정보주체가 본 약관에 동의하고 회사가 정한 소정의 절차에 따라 서비스의 이용자로 등록함으로써 효력이 발생합니다.<br/>
              2. 회원이 온라인에서 본 약관 "동의하기" 버튼을 클릭하였을 경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 그 적용에 동의한 것으로 간주합니다.<br/>
              3. 회사는 위치정보의 보호 및 이용 등에 관한 법률, 콘텐츠산업 진흥법, 전자상거래 등에서의 소비자보호에 관한 법률, 소비자기본법 약관의 규제에 관한 법률 등 관련법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.<br/>
              4. 회사가 약관을 개정할 경우에는 기존약관과 개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그 적용일자 10일 전부터 적용일 이후 상당한 기간 동안 공지만을 하고, 개정 내용이 회원에게 불리한 경우에는 그 적용일자 30일 전부터 적용일 이후 상당한 기간 동안 각각 이를 서비스 홈페이지에 게시하거나 회원에게 전자적 형태(전자우편, SMS 등)로 약관 개정 사실을 발송하여 고지합니다.<br/>
              5. 회사가 전항에 따라 회원에게 통지하면서 공지 또는 공지∙고지일로부터 개정약관 시행일 7일 후까지 거부의사를 표시하지 아니하면 이용약관에 승인한 것으로 봅니다. 회원이 개정약관에 동의하지 않을 경우 회원은 이용계약을 해지할 수 있습니다.<br/>
              </div>
              <h4>제 3 조 (관계법령의 적용)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에 명시되지 아니한 사항에 대하여는 관계법령 또는 상관례에 따릅니다.
              </div>
              <h4>제 4 조 (서비스의 내용)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              회사가 제공하는 서비스는 아래와 같습니다.<br/>
              - 위치정보수집 대상의 실시간 위치확인<br/>
              - 회원 위치에서 근접한 게시글 정보 제공<br/>
              </div>
              <h4>제 5 조 (서비스 이용요금)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사가 제공하는 서비스는 기본적으로 무료입니다. 단, 별도의 유료 서비스의 경우 해당 서비스에 명시된 요금을 지불하여야 사용 가능합니다.<br/>
              2. 회사는 유료 서비스 이용요금을 회사와 계약한 전자지불업체에서 정한 방법에 의하거나 회사가 정한 청구서에 합산하여 청구할 수 있습니다.<br/>
              3. 유료서비스 이용을 통하여 결제된 대금에 대한 취소 및 환불은 회사의 결제 이용약관 등 관계법에 따릅니다.<br/>
              4. 회원의 개인정보도용 및 결제사기로 인한 환불요청 또는 결제자의 개인정보 요구는 법률이 정한 경우 외에는 거절될 수 있습니다.<br/>
              5. 무선 서비스 이용 시 발생하는 데이터 통신료는 별도이며 가입한 각 이동통신사의 정책에 따릅니다.<br/>
              </div>
              <h4>제 6 조 (서비스내용변경 통지 등)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 회원의 등록된 전자우편 주소로 이메일을 통하여 서비스 내용의 변경 사항 또는 종료를 통지할 수 있습니다.<br/>
              2. "1."항의 경우 불특정 다수인을 상대로 통지를 함에 있어서는 웹사이트 등 기타 회사의 공지사항을 통하여 회원들에게 통지할 수 있습니다.<br/>
              </div>
              <h4>제 7 조 (서비스이용의 제한 및 중지)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 아래 각 호의 1에 해당하는 사유가 발생한 경우에는 회원의 서비스 이용을 제한하거나 중지시킬 수 있습니다.<br/>
              <div style={{marginLeft:"7px"}}>
              1) 회원이 회사 서비스의 운영을 고의 또는 중과실로 방해하는 경우<br/>
              2) 서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우<br/>
              3) 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우<br/>
              4) 국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때<br/>
              5) 기타 중대한 사유로 인하여 회사가 서비스 제공을 지속하는 것이 부적당하다고 인정하는 경우<br/>
              </div>
              2. 회사는 전항의 규정에 의하여 서비스의 이용을 제한하거나 중지한 때에는 그 사유 및 제한기간 등을 회원에게 알려야 합니다.<br/>
              </div>
              <h4>제 8 조 (개인위치정보의 이용 또는 제공)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 개인위치정보를 이용하여 서비스를 제공하고자 하는 경우에는 미리 이용약관에 명시한 후 개인위치정보주체의 동의를 얻어야 합니다.<br/>
              2. 회원 및 법정대리인의 권리와 그 행사방법은 제소 당시의 이용자의 주소에 의하며, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 이용자의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.<br/>
              3. 회사는 타사업자 또는 이용 고객과의 요금정산 및 민원처리를 위해 위치정보 이용·제공, 사실 확인자료를 자동 기록·보존하며, 해당 자료는 1개월간 보관합니다.<br/>
              4. 회사는 개인위치정보를 회원이 지정하는 제3자에게 제공하는 경우에는 개인위치정보를 수집한 당해 통신 단말장치로 매회 회원에게 제공받는 자, 제공일시 및 제공목적을 즉시 통보합니다. 단, 아래 각 호의 1에 해당하는 경우에는 회원이 미리 특정하여 지정한 통신 단말장치 또는 전자우편주소로 통보합니다.<br/>
              <div style={{marginLeft:"7px"}}>
              1) 개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우<br/>
              2) 회원이 온라인 게시 등의 방법으로 통보할 것을 미리 요청한 경우<br/>
              </div>
              <h4>제 9 조 (개인위치정보주체의 권리)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회원은 회사에 대하여 언제든지 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의의 전부 또는 일부를 철회할 수 있습니다. 이 경우 회사는 수집한 개인위치정보 및 위치정보 이용, 제공사실 확인자료를 파기합니다.<br/>
              2. 회원은 회사에 대하여 언제든지 개인위치정보의 수집, 이용 또는 제공의 일시적인 중지를 요구할 수 있으며, 회사는 이를 거절할 수 없고 이를 위한 기술적 수단을 갖추고 있습니다.<br/>
              3. 회원은 회사에 대하여 아래 각 호의 자료에 대한 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그 정정을 요구할 수 있습니다. 이 경우 회사는 정당한 사유 없이 회원의 요구를 거절할 수 없습니다.<br/>
              <div style={{marginLeft:"7px"}}>
              1) 본인에 대한 위치정보 수집, 이용, 제공사실 확인자료<br/>
              2) 본인의 개인위치정보가 위치정보의 보호 및 이용 등에 관한 법률 또는 다른 법률 규정에 의하여 제3자에게 제공된 이유 및 내용<br/>
              </div>
              4. 회원은 제1항 내지 제3항의 권리행사를 위해 회사의 소정의 절차를 통해 요구할 수 있습니다.<br/>
              </div>
              <h4>제 10 조 (법정대리인의 권리)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 14세 미만의 회원에 대해서는 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의를 당해 회원과 당해 회원의 법정대리인으로부터 동의를 받아야 합니다. 이 경우 법정대리인은 제9조에 의한 회원의 권리를 모두 가집니다.<br/>
              2. 2. 회사는 14세 미만의 아동의 개인위치정보 또는 위치정보 이용․제공사실 확인자료를 이용약관에 명시 또는 고지한 범위를 넘어 이용하거나 제3자에게 제공하고자 하는 경우에는 14세미만의 아동과 그 법정대리인의 동의를 받아야 합니다. 단, 아래의 경우는 제외합니다.<br/>
              <div style={{marginLeft:"7px"}}>
              1) 위치정보 및 위치기반서비스 제공에 따른 요금정산을 위하여 위치정보 이용, 제공사실 확인자료가 필요한 경우<br/>
              2) 통계작성, 학술연구 또는 시장조사를 위하여 특정 개인을 알아볼 수 없는 형태로 가공하여 제공하는 경우<br/>
              </div>
              </div>
              <h4>제 6 조 (서비스내용변경 통지 등제 11 조 (위치정보관리책임자의 지정))</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 위치정보를 적절히 관리․보호하고 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보관리책임자로 지정해 운영합니다.<br/>
              2. 위치정보관리책임자의 구체적인 사항은 본 약관의 부칙에 따릅니다.<br/>
              </div>
              <h4>제 12 조 (손해배상)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사가 위치정보의 보호 및 이용 등에 관한 법률 제15조 내지 제26조의 규정을 위반한 행위로 회원에게 손해가 발생한 경우 회원은 회사에 대하여 손해배상 청구를 할 수 있습니다. 이 경우 회사는 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할 수 없습니다. 회원이 서비스 및 혜택받기를 이용하면서 불법행위 또는 고의나 과실로 이 약관을 위한하여 회사가 해당 고객 이외의 제 3자로부터 손해배상청구 또는 소송을 비롯한 각종이의제기를 받는다면 해당 고객은 그 때문에 회사에 발생한 손해를 배상해야 합니다.<br/>
              2. 회원이 본 약관의 규정을 위반하여 회사에 손해가 발생한 경우 회사는 회원에 대하여 손해배상을 청구할 수 있습니다. 이 경우 회원은 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할 수 없습니다.<br/>
              </div>
              <h4>제 13 조 (면책)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 다음 각 호의 경우로 서비스를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.<br/>
              <div style={{marginLeft:"7px"}}>
              1) 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우<br/>
              2) 서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의 고의적인 서비스 방해가 있는 경우<br/>
              3) 회원의 귀책사유로 서비스 이용에 장애가 있는 경우<br/>
              4) 제1호 내지 제3호를 제외한 기타 회사의 고의∙과실이 없는 사유로 인한 경우<br/>
              </div>
              2. 회사는 서비스 및 서비스에 게재된 정보, 자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 회원의 손해에 대하여는 책임을 부담하지 아니합니다.
              </div>
              <h4>제 14 조 (규정의 준용)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 본 약관은 대한민국법령에 의하여 규정되고 이행됩니다.<br/>
              2. 본 약관에 규정되지 않은 사항에 대해서는 관련법령 및 상관습에 의합니다.<br/>
              </div>
              <h4>제 15 조 (분쟁의 조정 및 기타)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 회사는 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 위치정보의 보호 및 이용 등에 관한 법률 제28조의 규정에 의한 방송통신위원회에 재정을 신청할 수 있습니다.<br/>
              2. 회사 또는 고객은 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 개인정보보호법 제43조의 규정에 의한 개인정보분쟁조정위원회에 조정을 신청할 수 있습니다.<br/>
              </div>
              <h4>제 16 조 (회사의 연락처)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 상 호 : Bungle<br/>
              2. email 주 소 : hjy583@naver.com<br/><br/>
              </div>
              <h4>부칙</h4>
              <h4>제 1 조 (시행일)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              1. 이 약관은 2022 년 7월 29일부터 적용됩니다.
              </div>
              <h4>제 2 조 (위치정보관리책임자)</h4>
              <div style={{ lineHeight:"200%", fontSize:"13px"}}>
              위치정보관리책임자는 2022년 07월 29일을 기준으로 다음과 같이 지정합니다.<br/>
              1. 성 명 : 김민수<br/>
              2. 연락처 : manager.kim86@gmail.com<br/><br/><br/><br/>
              </div>
              
              </div>
            </div>
          </div>
        </div>
      </TermsConditionsWrap>
  );
}
export const TermsConditionsWrap = styled.div`
  width: 100%; // 100% -> 375px
  /* max-height: 780px; */
  /* height: 90%; */
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  margin: auto;
`;

export default TermsConditions